## **เชื่อมต่อฐานข้อมูล pokemon.db(Connect Database)**

In [121]:
# Phutharesuan Wachirapisut
# 651610348
# Lab04
# 229323 sec 002

In [122]:
import sqlite3

conn = sqlite3.connect('pokemon.db')
print("Opened database successfully")
conn.close()

Opened database successfully

## **สร้างตารางฐานข้อมูล (Create Table)**

### สร้างตาราง Pokemon

In [123]:
conn = sqlite3.connect('pokemon.db')

with conn:
  conn.execute('''
  CREATE TABLE CATCH_POKEMON
         (ID INTEGER PRIMARY KEY AUTOINCREMENT,
         KIND           TEXT    NOT NULL,
         FOUND_NO       INT     NOT NULL,
         CAUGHT_NO      INT     NOT NULL)
         ''')

conn.close()
print("Table created successfully")

OperationalError: table CATCH_POKEMON already exists

### นำข้อมูลเข้าตาราง Pokemon

In [ ]:
conn = sqlite3.connect('pokemon.db')

with conn:
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Pikasu', 10, 7)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Carpeter', 15, 8)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Beedle', 32, 24)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Poppo', 17, 9)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Koratta', 16, 12)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Onitsumi', 20, 14)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Arbo', 28, 17)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Konpang', 12, 5)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Neauroma', 5, 4)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Tamatama', 18, 8)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Kokoon', 8, 5)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Pigeon', 26, 17)")
  conn.execute("INSERT INTO CATCH_POKEMON (KIND, FOUND_NO, CAUGHT_NO) VALUES ('Camel', 17, 12)")
  # conn.commit()

conn.close()
print("Records created successfully")

Records created successfully

### สร้างตาราง find_pokemon

In [ ]:
conn = sqlite3.connect('pokemon.db')

with conn:
  conn.execute('''CREATE TABLE FIND_POKEMON
         (ID INTEGER PRIMARY KEY    AUTOINCREMENT,
         KIND            TEXT    NOT NULL,
         SCHOOL          INT     NOT NULL,
         PLAYGROUND      INT     NOT NULL,
         SHOPPING_MALL   INT     NOT NULL)
         ''')

conn.close()
print("Table created successfully")

Table created successfully

### Import Data into find_pokemon

In [ ]:
conn = sqlite3.connect('pokemon.db')

with conn:
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Pikasu', 5, 7,5)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Carpeter', 8, 5, 10)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Beedle', 18, 13, 25)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Poppo', 10, 7, 9)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Koratta', 12, 8, 10)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Onitsumi', 11, 9, 14)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Arbo', 15, 22, 8)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Konpang', 7, 6, 6)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Neauroma', 3, 2, 4)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Tamatama', 6, 10, 10)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Kokoon', 4, 9, 3)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Pigeon', 16, 15, 12)")
  conn.execute("INSERT INTO FIND_POKEMON (KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL) VALUES ('Camel', 8, 11, 10)")
  conn.commit()

conn.close()
print("Records created successfully")

Records created successfully

## **สร้าง Utility สำหรับดูข้อมูล**

In [ ]:
import numpy as np
import pandas as pd

def get_data(cursor):
  all_rows = cursor.fetchall()
  #[all_rows.append(np.array(row)) for row in cursor]
  column_names = [description[0] for description in cursor.description]
  df = pd.DataFrame(data=all_rows, columns = column_names)
  # ซ่อน index
  blankIndex=[''] * len(df)
  df.index=blankIndex
  return df

## **คิวรี่ข้อมูลจากตาราง(Select From Table)**

In [ ]:
conn = sqlite3.connect('pokemon.db')

with conn:
  cursor = conn.execute("SELECT KIND, FOUND_NO, CAUGHT_NO FROM CATCH_POKEMON")

df=get_data(cursor)
conn.close()
print("Operation done successfully")
df

Operation done successfully

      KIND  FOUND_NO  CAUGHT_NO
    Pikasu        10          7
  Carpeter        15          8
    Beedle        32         24
     Poppo        17          9
   Koratta        16         12
  Onitsumi        20         14
      Arbo        28         17
   Konpang        12          5
  Neauroma         5          4
  Tamatama        18          8
    Kokoon         8          5
    Pigeon        26         17
     Camel        17         12

In [ ]:
conn = sqlite3.connect('pokemon.db')

with conn:
  cursor = conn.execute("SELECT * FROM FIND_POKEMON")

df=get_data(cursor)
conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID      KIND  SCHOOL  PLAYGROUND  SHOPPING_MALL
   1    Pikasu       5           7              5
   2  Carpeter       8           5             10
   3    Beedle      18          13             25
   4     Poppo      10           7              9
   5   Koratta      12           8             10
   6  Onitsumi      11           9             14
   7      Arbo      15          22              8
   8   Konpang       7           6              6
   9  Neauroma       3           2              4
  10  Tamatama       6          10             10
  11    Kokoon       4           9              3
  12    Pigeon      16          15             12
  13     Camel       8          11             10

## จากตารางข้อมูลที่กำหนดให้ จงทำการคำนวณและแสดงผลของข้อมูลต่อไปนี้

### a. คำนวณผลรวมของชนิด pokemon ที่มีอยู่ว่าแต่ละชนิดถูกพบและจับได้จำนวนอย่างละเท่าใด -> READ

In [ ]:
conn = sqlite3.connect("pokemon.db")

with conn:
    result = conn.execute("SELECT KIND, (FOUND_NO + CAUGHT_NO) as SUM_FOUND_CAUGHT  FROM CATCH_POKEMON;")
    
df = get_data(result)
conn.close()
print("Operation done successfully")
df

Operation done successfully

      KIND  SUM_FOUND_CAUGHT
    Pikasu                17
  Carpeter                23
    Beedle                56
     Poppo                26
   Koratta                28
  Onitsumi                34
      Arbo                45
   Konpang                17
  Neauroma                 9
  Tamatama                26
    Kokoon                13
    Pigeon                43
     Camel                29

### b. คำนวณค่าสัดส่วนร้อยละของจำนวนที่จับได้ต่อจำนวนที่พบ โดยแสดงเป็น column ใหม่ชื่อ performance -> CREATE + UPDATE + READ

In [ ]:
conn = sqlite3.connect("pokemon.db")

with conn:
    result = conn.execute("SELECT *, CAUGHT_NO*100.0/FOUND_NO AS PERFORMANCE FROM CATCH_POKEMON CP;")
df = get_data(result)
conn.commit()
conn.close()
print("Operation done successfully")
df

Operation done successfully

  ID      KIND  FOUND_NO  CAUGHT_NO  PERFORMANCE
   1    Pikasu        10          7    70.000000
   2  Carpeter        15          8    53.333333
   3    Beedle        32         24    75.000000
   4     Poppo        17          9    52.941176
   5   Koratta        16         12    75.000000
   6  Onitsumi        20         14    70.000000
   7      Arbo        28         17    60.714286
   8   Konpang        12          5    41.666667
   9  Neauroma         5          4    80.000000
  10  Tamatama        18          8    44.444444
  11    Kokoon         8          5    62.500000
  12    Pigeon        26         17    65.384615
  13     Camel        17         12    70.588235

### c. แสดงผลโดยจัดเรียงตามชื่อชนิดของ pokemon -> READ

In [ ]:
conn = sqlite3.connect("pokemon.db")

with conn:
    result = conn.execute("SELECT *, (CP.CAUGHT_NO*100.0/CP.FOUND_NO) AS PERFORMANCE FROM CATCH_POKEMON CP ORDER BY KIND ASC;")

df = get_data(result)
conn.commit()
conn.close()

print("Operation done successfully")
df

Operation done successfully

  ID      KIND  FOUND_NO  CAUGHT_NO  PERFORMANCE
   7      Arbo        28         17    60.714286
   3    Beedle        32         24    75.000000
  13     Camel        17         12    70.588235
   2  Carpeter        15          8    53.333333
  11    Kokoon         8          5    62.500000
   8   Konpang        12          5    41.666667
   5   Koratta        16         12    75.000000
   9  Neauroma         5          4    80.000000
   6  Onitsumi        20         14    70.000000
  12    Pigeon        26         17    65.384615
   1    Pikasu        10          7    70.000000
   4     Poppo        17          9    52.941176
  10  Tamatama        18          8    44.444444

### d. จากตารางที่ 1 แสดงผลตามเรียงตามลำดับของจำนวนที่พบแต่จับไม่ได้เป็นลำดับแรก และจำนวนที่พบและจับได้เป็นลำดับสอง(โดยเรียงจากมากไปน้อย) -> READ

In [120]:
conn = sqlite3.connect("pokemon.db")

with conn:
    result = conn.execute("SELECT *, (CAUGHT_NO*100.0/FOUND_NO) AS PERFORMANCE FROM CATCH_POKEMON ORDER BY FOUND_NO DESC, CAUGHT_NO DESC")

df=get_data(result)
conn.close()

print("Operation done successfully")
df

Operation done successfully

  ID      KIND  FOUND_NO  CAUGHT_NO  PERFORMANCE
   3    Beedle        32         24    75.000000
   7      Arbo        28         17    60.714286
  12    Pigeon        26         17    65.384615
   6  Onitsumi        20         14    70.000000
  10  Tamatama        18          8    44.444444
  13     Camel        17         12    70.588235
   4     Poppo        17          9    52.941176
   5   Koratta        16         12    75.000000
   2  Carpeter        15          8    53.333333
   8   Konpang        12          5    41.666667
   1    Pikasu        10          7    70.000000
  11    Kokoon         8          5    62.500000
   9  Neauroma         5          4    80.000000

### e. แสดงชื่อชนิดของ pokemon ที่มีค่า performance >= 65% -> READ

In [134]:
conn = sqlite3.connect("pokemon.db")

with conn:
    result = conn.execute("SELECT *, (CAUGHT_NO*100.0/FOUND_NO) AS PERFORMANCE FROM CATCH_POKEMON CP WHERE PERFORMANCE>=65;")

df=get_data(result)
conn.commit()
print("Operation done successfully")
df

Operation done successfully

  ID      KIND  FOUND_NO  CAUGHT_NO  PERFORMANCE
   1    Pikasu        10          7    70.000000
   3    Beedle        32         24    75.000000
   5   Koratta        16         12    75.000000
   6  Onitsumi        20         14    70.000000
   9  Neauroma         5          4    80.000000
  12    Pigeon        26         17    65.384615
  13     Camel        17         12    70.588235

### f. แสดงชนิดของ pokemon เพียง 2 ขนิดที่มีค่า performance สูงสุด และต่ำสุด -> READ

pokemon ที่มีค่า performance สูงสุด

In [136]:
with conn:
    result = conn.execute("SELECT *,MAX((CAUGHT_NO*100.0/FOUND_NO)) AS PERFORMANCE FROM CATCH_POKEMON")

df = get_data(result)
df

  ID      KIND  FOUND_NO  CAUGHT_NO  PERFORMANCE
   9  Neauroma         5          4         80.0

pokemon ที่มีค่า performance ต่ำสุด

In [155]:
with conn:
    result = conn.execute("SELECT *,MIN((CAUGHT_NO*100.0/FOUND_NO)) AS PERFORMANCE FROM CATCH_POKEMON")

df = get_data(result)
print("Operation done successfully")
df

Operation done successfully

  ID     KIND  FOUND_NO  CAUGHT_NO  PERFORMANCE
   8  Konpang        12          5    41.666667

pokemon ที่มีค่าสูงสุดและต่ำสุด

In [156]:
with conn:
    result = conn.execute("SELECT *,MAX((CAUGHT_NO*100.0/FOUND_NO)) AS PERFORMANCE  FROM CATCH_POKEMON\
        UNION\
            SELECT *, MIN((CAUGHT_NO*100.0/FOUND_NO)) AS PERFORMANCE  FROM CATCH_POKEMON;")
df = get_data(result)
print("Operation done successfully")

df

Operation done successfully

  ID      KIND  FOUND_NO  CAUGHT_NO  PERFORMANCE
   8   Konpang        12          5    41.666667
   9  Neauroma         5          4    80.000000

### g. แสดงผลรวมของชนิด pokemon ที่จับได้ จากตารางที่ 2

In [157]:
with conn:
    df = get_data(conn.execute("SELECT KIND, (SCHOOL+PLAYGROUND+SHOPPING_MALL) AS SUM_CAUGHT FROM FIND_POKEMON"))

print("Operation done successfully")

df

Operation done successfully

      KIND  SUM_CAUGHT
    Pikasu          17
  Carpeter          23
    Beedle          56
     Poppo          26
   Koratta          30
  Onitsumi          34
      Arbo          45
   Konpang          19
  Neauroma           9
  Tamatama          26
    Kokoon          16
    Pigeon          43
     Camel          29

### h. แสดงชนิดของ pokemon ที่เมื่อตรวจสอบแล้วพบว่าผลรวมชนิดของ pokemon จากตารางที่ 1 และ 2 ไม่ตรงกันจากนั้นให้ทำการลบ record ที่ไม่สอดคล้องกัน ออกจากตารางทั้งสอง -> READ, DELETE

In [167]:
with conn:
    df = get_data(conn.execute("SELECT KIND, (CAUGHT_NO+FOUND_NO) AS TOTAL FROM CATCH_POKEMON"))
print("Operation done successfully")
df

Operation done successfully

      KIND  TOTAL
    Pikasu     17
  Carpeter     23
    Beedle     56
     Poppo     26
   Koratta     28
  Onitsumi     34
      Arbo     45
   Konpang     17
  Neauroma      9
  Tamatama     26
    Kokoon     13
    Pigeon     43
     Camel     29

In [166]:
with conn:
    df = get_data(conn.execute("SELECT KIND, (SCHOOL+PLAYGROUND+SHOPPING_MALL) AS TOTAL FROM FIND_POKEMON"))
print("Operation done successfully")
df

Operation done successfully

      KIND  TOTAL
    Pikasu     17
  Carpeter     23
    Beedle     56
     Poppo     26
   Koratta     30
  Onitsumi     34
      Arbo     45
   Konpang     19
  Neauroma      9
  Tamatama     26
    Kokoon     16
    Pigeon     43
     Camel     29

In [245]:
with conn:
    df = get_data(conn.execute("SELECT T2.KIND, (CAUGHT_NO + FOUND_NO) AS SUM_T1,(SCHOOL + PLAYGROUND + SHOPPING_MALL) AS SUM_T2  \
        FROM CATCH_POKEMON T1 \
        INNER JOIN FIND_POKEMON T2\
        ON T1.KIND = T2.KIND\
        WHERE SUM_T1 != SUM_T2")
    )
print("Operation done successfully")
df

Operation done successfully

     KIND  SUM_T1  SUM_T2
  Koratta      28      30
  Konpang      17      19
   Kokoon      13      16

In [275]:
with conn:
    df = get_data(
        conn.execute("""
        SELECT ID, KIND,FOUND_NO, CAUGHT_NO ,
            (CAUGHT_NO * 100.0/FOUND_NO) PERFORMANCE,
            (FOUND_NO + CAUGHT_NO) SUM_POKEMON
        FROM (SELECT T2.ID , T2.KIND,T1.FOUND_NO, T1.CAUGHT_NO,
                (T1.CAUGHT_NO + T1.FOUND_NO) AS SUM_T1,
                (T2.SCHOOL + T2.PLAYGROUND + T2.SHOPPING_MALL) AS SUM_T2
            FROM CATCH_POKEMON T1 
            INNER JOIN FIND_POKEMON T2
            ON T1.KIND = T2.KIND) SUB
        WHERE SUM_T1 = SUM_T2
        """)
    )
print("Operation done successfully")
df

Operation done successfully

  ID      KIND  FOUND_NO  CAUGHT_NO  PERFORMANCE  SUM_POKEMON
   1    Pikasu        10          7    70.000000           17
   2  Carpeter        15          8    53.333333           23
   3    Beedle        32         24    75.000000           56
   4     Poppo        17          9    52.941176           26
   6  Onitsumi        20         14    70.000000           34
   7      Arbo        28         17    60.714286           45
   9  Neauroma         5          4    80.000000            9
  10  Tamatama        18          8    44.444444           26
  12    Pigeon        26         17    65.384615           43
  13     Camel        17         12    70.588235           29

In [279]:
with conn:
    df = get_data(
        conn.execute("""
        SELECT ID, KIND,
            SCHOOL, PLAYGROUND, SHOPPING_MALL,
            (FOUND_NO + CAUGHT_NO) SUM_FIND
        FROM (SELECT T2.ID , T2.KIND,T1.FOUND_NO, T1.CAUGHT_NO,
                (T1.CAUGHT_NO + T1.FOUND_NO) AS SUM_T1,
                (T2.SCHOOL + T2.PLAYGROUND + T2.SHOPPING_MALL) AS SUM_T2, SCHOOL,PLAYGROUND, SHOPPING_MALL
            FROM CATCH_POKEMON T1 
            INNER JOIN FIND_POKEMON T2
            ON T1.KIND = T2.KIND) SUB
        WHERE SUM_T1 = SUM_T2
        """)
    )
print("Operation done successfully")
df

Operation done successfully

  ID      KIND  SCHOOL  PLAYGROUND  SHOPPING_MALL  SUM_FIND
   1    Pikasu       5           7              5        17
   2  Carpeter       8           5             10        23
   3    Beedle      18          13             25        56
   4     Poppo      10           7              9        26
   6  Onitsumi      11           9             14        34
   7      Arbo      15          22              8        45
   9  Neauroma       3           2              4         9
  10  Tamatama       6          10             10        26
  12    Pigeon      16          15             12        43
  13     Camel       8          11             10        29

### *หลังจากทำการตัดข้อมูลที่ไม่สอดคล้อง* แล้วให้ดำเนินการต่อไปนี้

### i. คำนวณผลรวมใหม่ของจำนวน pokemon ที่พบได้ตามสถานที่ต่างๆ โดยสร้างตารางเก็บผลรวมขึ้นมาใหม่ชื่อว่า all_pokemon  (กำหนดให้ตารางมีข้อมูล primary key, ชื่อของชนิด pokemon และจำนวนผลรวม โดยนักศึกษากำหนดชื่อคอลัมน์เหล่านี้ได้เอง) -> CREATE

In [295]:
with conn:
    conn.execute("""
    CREATE TABLE all_POKEMON
    (ID INT KEY NOT NULL
    KIND TEXT NOT NULL
    SCHOOL INT NOT NULL
    PLAYGROUND INT NOT NULL
    SHOPPING_MALL INT NOT NULL
    );""")

In [296]:
with conn:
    conn.execute("""INSERT INTO all_POKEMON SELECT * FROM 
    (SELECT ID, KIND, SCHOOL, PLAYGROUND, SHOPPING_MALL
        FROM (SELECT T2.ID , T2.KIND,T1.FOUND_NO, T1.CAUGHT_NO,
                (T1.CAUGHT_NO + T1.FOUND_NO) AS SUM_T1,
                (T2.SCHOOL + T2.PLAYGROUND + T2.SHOPPING_MALL) AS SUM_T2, SCHOOL,PLAYGROUND, SHOPPING_MALL
            FROM CATCH_POKEMON T1 
            INNER JOIN FIND_POKEMON T2
            ON T1.KIND = T2.KIND) SUB WHERE SUM_T1 = SUM_T2)""")

### j. จากข้อมูลในตารางที่ 2 แสดงชื่อชนิดของ pokemon ที่พบได้มากที่สุดแยกตามประเภทสถานที่ คือ playground pokemon ชนิดใดพบมากที่สุด, school พบ pokemon ชนิดใดมากที่สุด และ shopping mall พบชนิดใดมากที่สุด -> READ

PLAYGROUND

In [319]:
with conn:
    df = get_data(conn.execute("""
    SELECT * FROM all_POKEMON WHERE PLAYGROUND = (SELECT max(PLAYGROUND) FROM all_POKEMON)
    """))
print("Operation done successfully")
    
df

Operation done successfully

  ID  KIND  SCHOOL  PLAYGROUND  SHOPPING_MALL
   7  Arbo      15          22              8

SCHOOL

In [320]:
with conn:
    df = get_data(conn.execute("""
    SELECT * FROM all_POKEMON WHERE SCHOOL = (SELECT max(SCHOOL) FROM all_POKEMON)
    """))
print("Operation done successfully")

df

Operation done successfully

  ID    KIND  SCHOOL  PLAYGROUND  SHOPPING_MALL
   3  Beedle      18          13             25

SHOPPING_MALL

In [321]:
with conn:
    df = get_data(conn.execute("""
    SELECT * FROM all_POKEMON WHERE SHOPPING_MALL = (SELECT max(SHOPPING_MALL) FROM all_POKEMON)
    """))
print("Operation done successfully")

df

Operation done successfully

  ID    KIND  SCHOOL  PLAYGROUND  SHOPPING_MALL
   3  Beedle      18          13             25

### k. แสดงข้อมูลที่ระบุว่า pokemon แต่ละชนิดนั้นพบถูกพบในสถานที่ใดมากที่สุด เช่น Pikasu พบที่ playground มากที่สุด Carpenter พบที่ shopping mall มากที่สุด และชนิดที่เหลือแต่ละชนิดพบที่ใดมากที่สุด

In [322]:
with conn:
    df = get_data(conn.execute("""
    SELECT KIND,
    CASE WHEN SCHOOL > PLAYGROUND AND SCHOOL > SHOPPING_MALL THEN 'SCHOOL'
    WHEN PLAYGROUND > SCHOOL AND PLAYGROUND > SHOPPING_MALL THEN 'PLAYGROUND'
    ELSE 'SHOPPING_MALL'
    END AS PLACE
    FROM all_POKEMON

    ;"""))

print("Operation done successfully")
df

Operation done successfully

      KIND          PLACE
    Pikasu     PLAYGROUND
  Carpeter  SHOPPING_MALL
    Beedle  SHOPPING_MALL
     Poppo         SCHOOL
  Onitsumi  SHOPPING_MALL
      Arbo     PLAYGROUND
  Neauroma  SHOPPING_MALL
  Tamatama  SHOPPING_MALL
    Pigeon         SCHOOL
     Camel     PLAYGROUND

### l. ให้ระบุว่า pokemon ชนิดที่พบและจับได้มากที่สุดคือชนิดใด และพบในสถานที่ใดมากที่สุด (นำข้อมูลการพบและจับได้จากตารางที่ 1 มาพิจารณาว่าชนิดใดจับได้มากที่สุด จากนั้นนำไปหาในตารางที่ 2 ว่าสถานที่ใดที่พบ pokemon ชนิดนี้มากที่สุดจาก 3 สถานที่) -> READ

In [324]:
with conn:
    df = get_data(conn.execute("""    
    SELECT AP.KIND,
    CASE WHEN SCHOOL > PLAYGROUND AND SCHOOL > SHOPPING_MALL THEN 'SCHOOL'
    WHEN PLAYGROUND > SCHOOL AND PLAYGROUND > SHOPPING_MALL THEN 'PLAYGROUND'
    ELSE 'SHOPPING_MALL'
    END AS PLACE
    FROM all_POKEMON AP
    INNER JOIN (SELECT KIND, MAX(FOUND_NO) AND MAX(CAUGHT_NO) FROM CATCH_POKEMON) CP
    ON CP.KIND = AP.KIND
    ;"""))

Operation done successfully

    KIND          PLACE
  Beedle  SHOPPING_MALL

### m. ให้ระบุว่า pokemon ที่มี performance มากที่สุดคือชนิดใดและนำไปค้นหาในตารางที่ 2 ว่าพบในสถานที่ใดมากที่สุด

In [326]:
with conn:
    df = get_data(conn.execute("""
    SELECT AP.KIND,
    CASE WHEN SCHOOL > PLAYGROUND AND SCHOOL > SHOPPING_MALL THEN 'SCHOOL'
    WHEN PLAYGROUND > SCHOOL AND PLAYGROUND > SHOPPING_MALL THEN 'PLAYGROUND'
    ELSE 'SHOPPING_MALL'
    END AS PLACE
    FROM all_POKEMON AP
    INNER JOIN (SELECT ID, KIND,FOUND_NO, CAUGHT_NO ,
            MAX(CAUGHT_NO * 100.0/FOUND_NO) PERFORMANCE,
            (FOUND_NO + CAUGHT_NO) SUM_POKEMON
        FROM (SELECT T2.ID , T2.KIND,T1.FOUND_NO, T1.CAUGHT_NO,
                (T1.CAUGHT_NO + T1.FOUND_NO) AS SUM_T1,
                (T2.SCHOOL + T2.PLAYGROUND + T2.SHOPPING_MALL) AS SUM_T2
            FROM CATCH_POKEMON T1 
            INNER JOIN FIND_POKEMON T2
            ON T1.KIND = T2.KIND) SUB
        WHERE SUM_T1 = SUM_T2) CP
    ON CP.KIND = AP.KIND
    ;"""))

print("Operation done successfully")
df

Operation done successfully

      KIND          PLACE
  Neauroma  SHOPPING_MALL

### n. แสดงจำนวน pokemon ที่พบได้ในแต่ละสถานที่โดยเรียงลำดับตามชื่อตัวอักษรจากน้อยไปหามาก -> READ

In [328]:
with conn:
    df = get_data(conn.execute("""
    SELECT KIND,SCHOOL, PLAYGROUND, SHOPPING_MALL
    FROM all_POKEMON
    ORDER BY KIND ASC
    ;"""))

print("Operation done successfully")
df

Operation done successfully

      KIND  SCHOOL  PLAYGROUND  SHOPPING_MALL
      Arbo      15          22              8
    Beedle      18          13             25
     Camel       8          11             10
  Carpeter       8           5             10
  Neauroma       3           2              4
  Onitsumi      11           9             14
    Pigeon      16          15             12
    Pikasu       5           7              5
     Poppo      10           7              9
  Tamatama       6          10             10

### o. แสดงค่าเฉลี่ยของจำนวน pokemon แต่ละชนิดที่จับได้ โดยเรียงลำดับตามค่าเฉลี่ยจากมากไปน้อย -> READ

In [339]:
with conn:
    df = get_data(conn.execute("""
    SELECT KIND, (SCHOOL + PLAYGROUND + SHOPPING_MALL)/3.0 MEAN
    FROM all_POKEMON
    ORDER BY MEAN DESC
    ;"""))

print("Operation done successfully")
df

Operation done successfully

      KIND       MEAN
    Beedle  18.666667
      Arbo  15.000000
    Pigeon  14.333333
  Onitsumi  11.333333
     Camel   9.666667
     Poppo   8.666667
  Tamatama   8.666667
  Carpeter   7.666667
    Pikasu   5.666667
  Neauroma   3.000000